Repository: divvun/satni-frontend
Catalog: src/locales/sms/messages.po
Languages: sms

source: (<0>Show all</0>)
sms: (<0>Čuäʹjat puk</0>)

source: {0}/{1} languages.
sms: {0}/{1} ǩiõl.

source: {0}/{1} sources.
sms: {0}/{1} teâttkääiv.

source: {stemsLength}/{totalCount} containing <0>{searchExpression}</0>
sms: {stemsLength}/{totalCount} kååʹtt ââʹnn seʹst ooccâmsääʹn <0>{searchExpression}</0>

source: {stemsLength}/{totalCount} ending in <0>{searchExpression}</0>
sms: {stemsLength}/{totalCount} koon looppâst lij ooccâmsääʹnn<0>{searchExpression}</0>

source: {stemsLength}/{totalCount} starting with <0>{searchExpression}</0>
sms: {stemsLength}/{totalCount} kååʹtt älgg ooccâmsaaʹnin <0>{searchExpression}</0>

source: <0>Error {0}</0>
sms: <0>Vââʹǩǩ {0}</0>

source: <0>Giellagáldu</0>
sms: <0>Ǩiõllkaʹlddi</0>

source: A
sms: adj

source: Álšateknihkka
sms: Energiateknikk

source: Approximately half of the content of the dictionary is taken by searching for parallels in a parallel corpus of administrative text. This work was financed by the Ministry of Local Government and Modernisation.
sms: Nuʹtt-a peäʹl sääʹnnpaaʹrin leät viǯǯam taarr-sääʹm palddlõskorpuuzzin, da tõn tuâj lij teäggtam Taar Kåʹdd- da vuʹvddkoontâr (Kommunal- og administrasjonsdepartementet).

source: Ásttoáigi ja faláštallan
sms: Sportt da frijjäiʹǧǧ

source: Ávnnasindustriija
sms: Aaunâsindustrii

source: Beaivválaš giella
sms: Juõʹǩǩpeivvsaž ǩiõll

source: Boazodoallu
sms: Puäʒʒhåidd

source: Category
sms: Kategoria

source: Choose dictionaries
sms: Vaʹlljed sääʹnnǩiiʹrjid

source: Choose languages
sms: Vaʹlljed ǩiõlid

source: Choose whether the search expression is in the start, middle or the end of words.
sms: Vaʹlljed ooʒʒak-a ciâlkki aalǥâst, kõõskâst leʹbe looppâst.

source: Click <0/> to see the inflection paradigm of words. Click <1/> to see examples of how the word is used.
sms: Teäʹddel <0/> što vuäinak saaʹni soojtemååʹbleǩ. Teäʹddel <1/>što vuäinak ouddmiârkid sääʹn âânnmõõžžâst.

source: Country
sms: Jânnam

source: Dáidda ja girjjálašvuohta
sms: Čeäppõs da ǩeerjlažvuõtt

source: Definition
sms: Meäʹrtelm

source: Delivered by
sms: Tååimtam

source: Dialect
sms: Suõmm

source: Dictionaries
sms: Sääʹnnǩeeʹrj

source: Dictionary articles will appear in this pane when you press a word in the search results to the left.
sms: Sääʹnnǩeʹrjjartikkeeʹl eʹtte tääzz, ko leäk vaʹlljääm sääʹn čiʹǯsbeäʹlnn ooccâmpuäđõõzzin.

source: Dihtorteknologiija ja diehtoteknihkka
sms: Teâtt-teknologia da teâtt-tekniikk

source: Do searches in <0>Giellagáldu's</0> term collection, <1>Pekka Sammallahti's North Sami – Finnish dictionary</1>, Hábmer municipality's <2>Lule Sámi - Norwegian</2> or <3>Norwegian - Lule Sámi</3> medicinal dictionaries and <4>Giellatekno's</4> <5>sami dictionaries</5>.
sms: Ooʒʒ <0>Ǩiõllkaʹlddi</0> termmnorrõõzz, <1>Pekka Sammallahti davvisámi – suoma sääʹnnǩeeʹrj</1>, Hábmer kååʹdd <2>Juuʹlevsääʹmǩiõll - Taarr</2> leʹbe <3>Taarr - Juuʹlevsääʹmǩiõll</3> medisiinlaž sääʹnnǩiiʹrjin da <4>Giellatekno</4> <5>sääʹm sääʹnnǩiiʹrjin</5>.

source: Eanandoallu
sms: Mäddtääll

source: Education
sms: Škooultõs

source: Ekologiija ja biras
sms: Ekologia da pirrõs

source: Ekonomiija ja gávppašeapmi
sms: Ekonomia da kaupptiõđ

source: Emeritusprofessor Pekka Sammallahti has based this dictionary on his own printed dictionaries published in 1989 and 1993.
sms: Emeritusprofessor Pekka Sammallahti lij ǩeeʹrjtam tän säʹnnǩeeʹrj jiijjâs 1989 da 1993 priʹnttjum sääʹnnǩiiʹrjid.

source: en
sms: Eŋgglõsǩiõll

source: en_genitive
sms: eŋgglõsǩiõl

source: eng
sms: Eŋgglõsǩiõll

source: eng_genitive
sms: eŋgglõsǩiõll

source: fi
sms: Lääʹddǩiõll

source: FI
sms: Lääʹddǩiõll

source: fi_genitive
sms: Lääʹddǩiõl

source: fin
sms: Lääʹddǩiõll

source: fin_genitive
sms: Lääʹddǩiõl

source: Geografiija
sms: Mäddtiõđ

source: Gielladieđa
sms: Ǩiõlltiõđ

source: Giellagáldu's main task is to standardise new terminology and written language for the Sami languages. The standardised terms from their <a href="satni.uit.no/termwiki">termbase<a> is exported daily to this site, to be easily accessible to the Sami community.
sms: Ǩiõllkaʹlddi väʹlddtuâjjan lij ođđ terminologia da ǩeeʹrjtum ǩiõl noormtummuš. Noormtum teerm viǯǯat juõʹǩǩ peeiʹv sij <a href="satni.uit.no/termwiki">teâttnorldõõǥǥâst<a>, što tõk leʹčče âʹlǩǩi ooccâd da ââʹnned.

source: gtfinnob
sms: Giellatekno lääʹdd - taar sääʹnnǩeʹrjj

source: gtfinsme
sms: Giellatekno lääʹdd - tuõddârsääʹm sääʹnnǩeʹrjj

source: gtfinsmn
sms: Giellatekno lääʹdd - aanrõšǩiõl sääʹnnǩeʹrjj

source: gtfinsms
sms: Giellatekno's Finnish – Skolt Sami dictionary

source: gtnobsma
sms: Giellatekno taar - saujjsääʹm sääʹnnǩeʹrjj

source: gtnobsme
sms: Giellatekno taar - tuõddârsääʹm sääʹnnǩeʹrjj

source: gtnobsms
sms: Giellatekno's Bokmål – Skolt Sami dictionary

source: gtrussms
sms: Giellatekno's Russian – Skolt Sami dictionary

source: gtsmanob
sms: Giellatekno saujjsääʹm - taar sääʹnnǩeʹrjj

source: gtsmefin
sms: Giellatekno tuõddârsääʹm - lääʹdd sääʹnnǩeʹrjj

source: gtsmenob
sms: Giellatekno tuõddârsääʹm - taar sääʹnnǩeʹrjj

source: gtsmesmn
sms: Giellatekno tuõddârsääʹm - aanrõšǩiõll sääʹnnǩeʹrjj

source: gtsmnfin
sms: Giellatekno aanrõšǩiõll - lääʹdd sääʹnnǩeʹrjj

source: gtsmnsme
sms: Giellatekno aanrõšǩiõll - tuõddârsääʹm sääʹnnǩeʹrjj

source: gtsmsfin
sms: Giellatekno's Skolt Sami - Finnish dictionary

source: gtsmsnob
sms: Giellatekno's Skolt Sami - Norwegian Bokmål dictionary

source: gtsmsrus
sms: Giellatekno's Skolt Sami - Russian dictionary

source: Gulahallanteknihkka
sms: Saakkeem

source: Guolástus
sms: Kueʹllšeellmõš

source: Hábmer municipality's Lule Sámi - Norwegian medicinal dictionary. Contains about 1600 search words.
sms: Hamarøy kååʹdd juuʹlevsääʹmǩiõll - taar taalkâstiõđlaž sääʹnnǩeʹrjj. Ââʹnn seʹst nuʹtt 1600 ooccâmsääʹnned.

source: Hábmer municipality's Norwegian - Lule Sámi medicinal dictionary. Contains about 1600 search words.
sms: Hamarøy kååʹdd taar - juuʹlevsääʹmǩiõll taalkâstiõđlaž sääʹnnǩeʹrjj. Ââʹnn seʹst nuʹtt 1600 ooccâmsääʹnned.

source: habmernobsmj
sms: Hamarøy taar - juʹlevsääʹm taalkâstiõtti sääʹnnǩeʹrjj

source: habmersmjnob
sms: Hamarøy juʹlevsääʹm - taar taalkâstiõtti sääʹnnǩeʹrjj

source: Help
sms: Veäʹǩǩ

source: Huksenteknihkka
sms: Raajjâmtekniikk

source: Inside the articles you can hide unwanted languages and dictionaries. To reactivate them, press <0/> or <1/> .
sms: Artikkeeʹli seʹst vuäitak võiddeed ǩiõlid leʹbe sääʹnnǩiiʹrjid, koid jiõk haaʹled vueiʹnned. Vuäǯǯak tõid mååust ko teäddlak <0/> leʹbe <1/> .

source: Juridihkka
sms: Lääʹǩǩtiõđ

source: Languages
sms: Ǩiõl

source: lat_genitive
sms: Latinaǩiõl

source: Lookup the search word
sms: Čuäʹjat puäʹđõõzz

source: Luonddudieđa ja matematihkka
sms: Luâtt-tiõđ da matematikk

source: Mášenteknihkka
sms: Mašinateknikk

source: Medisiidna
sms: Taalkâstiõđ

source: N
sms: subst.

source: nb
sms: Ǩeʹrjjtaarǩiõll

source: nb_genitive
sms: Ǩeʹrjjtaarǩiõl

source: nn
sms: Ođđtaarǩiõll

source: nn_genitive
sms: ođđtaarǩiõl

source: nno
sms: Ođđtaarǩiõll

source: nno_genitive
sms: Ođđtaarǩiõl

source: NO
sms: Taarr

source: No results for <0>{searchExpression}</0>
sms: <0>{searchExpression}</0> ij kaunnu sääʹnnǩiiʹrjin

source: nob
sms: Ǩeʹrjjtaarǩiõll

source: nob_genitive
sms: Ǩeʹrjjtaarǩiõl

source: Norwegian → North Sámi is based on the North Sámi → Norwegian dictionary, but frequent Norwegian words have been added. It contains about 26,000 Norwegian entries.
sms: Taar → tuõddârsääʹm vuâđđan lij tuõddârsääʹm → taar sääʹnnǩeʹrjj, leâša takai taar saaʹnid leät lââʹzztam. Tõt ââʹnn seʹst nuʹt 26.000 taar sääʹnned.

source: Note:
sms: Hoʹhsse:

source: Paradigm
sms: Soojtemååʹbleǩ

source: Religion
sms: Åskldõk

source: Results for «{lemma}»
sms: «{lemma}» puäđõõzz

source: Results only from
sms: Puäđõõzz tåʹlǩ

source: Sámi letters
sms: Sääʹmbukva

source: sammallahtismefin
sms: Pekka Sammallahti tuõddârsääʹm - lääʹdd sääʹnnǩeʹrjj

source: se
sms: Tuõddârsääʹmǩiõll

source: SE
sms: Ruõcc

source: se_genitive
sms: Tuõddârsääʹmǩiõl

source: Search mode:
sms: Ooccâm-mood:

source: Search results will appear here.
sms: Ooccâmpuäđõõzz eʹtte tääzz.

source: Search words that contain your search term
sms: Ooʒʒ saaʹnid, kook âʹnne seʹst ooccâmteermad

source: Search words that end in your search term
sms: Ooʒʒ saaʹnid, kook loʹppe ooccâmtermmsad

source: Search words that start with your search term
sms: Ooʒʒ saaʹnid, kook äʹlǧǧe ooccâmteeʹrminad

source: Servodatdieđa
sms: Õhttsažkåʹddtiõđ

source: Show paradigm for this word
sms: Čuäjat tän sääʹn soojtemååʹbleǩ

source: Show this word in our corpus
sms: Čuäjat sääʹnn korpuuzzâst

source: sma
sms: Saujjsääʹmǩiõll

source: sma_genitive
sms: Saujjsääʹmǩiõl

source: sme
sms: Tuõddârsääʹmǩiõll

source: sme_genitive
sms: Tuõddârsääʹmǩiõl

source: smj
sms: Juuʹlevsääʹmǩiõll

source: smj_genitive
sms: Juuʹlevsääʹmǩiõl

source: smn
sms: Aanrõšǩiõll

source: smn_genitive
sms: Aanrõšǩiõl

source: sms
sms: Sääʹmǩiõll

source: sms_genitive
sms: Sääʹmǩiõl

source: Source:
sms: Teâttkäivv:

source: Stáda almmolaš hálddašeapmi
sms: Õõlmâsvaaldâšm

source: Status:
sms: Staattus:

source: sv
sms: Ruõccǩiõll

source: sv_genitive
sms: Ruõccǩiõl

source: swe
sms: Ruõccǩiõll

source: swe_genitive
sms: Ruõccǩiõl

source: Teknihkka industriija duodji
sms: Teknikk, industrii da ǩiõtt-tuâjj

source: termwiki
sms: Ǩiõllkaʹlddi määŋgǩiõllsaž teʹrmmsannõs

source: The dictionary contains about 11,000 entries.
sms: Sääʹnnǩeeʹrjest lie nuʹt 11000 ooccâmsääʹn.

source: The dictionary contains more than 50.000 entries, and Sammallahti adds entries regularly.
sms: Sääʹnnǩeeʹrjest lie pâʹjjel 50 000 sääʹnned, da Sammallahti lââʹzzat materiaal kõskkmieʹrin.

source: The input field accepts sami, nordic, english and latin search words. If you do not have Sami letters on your device, press <0/> to write them in the input field.
sms: Ooccâmǩeâdda vuäitak ǩeeʹrjted sääʹm-, tâʹvvjânnmi, eŋgglõsǩiõl da latina ooccâmsaaʹnin. Jõs tuʹst jie leäkku sääʹmfoont, teäddal <0/> što vuäitak ǩeeʹrjted tõid ooccâmǩeâdda.

source: The termbase consists of over 50,000 term articles, and is updated on a regular basis.
sms: Teʹrmmnorldõõǥǥâst lie pâʹjjel 50 000 teeʹrm da tõn peeiʹvtet kõskkmieʹrin.

source: There is no paradigm for this word
sms: Tän sänna jeät kaunnu soojtemååʹbleǩ

source: This dictionary builds on material prepared by Albert Jåma and Tove Brustad in the Hemnes Saami Organization, but has in addition gained words from Giellatekno and Aajege's work with the Southern Sámi Oahpa.
sms: Tät sääʹnnǩeʹrjj vuâđđââvv Albert Jåma da Tove Brustad materiaaʹle Hemnes Sääʹmorganisaatiost, leâša lij lââʹssen vuäǯǯam saaʹnid Giellateknost da Aajege saujjsääʹm Oahpa tuâjast.

source: This dictionary builds on Nils Jernsletten's dictionary Álgosátnegirji (4322 words), but now it contains 30,000 entries, plus 6000 place name entries.
sms: Tät sääʹnnǩeʹrjj vuâđđââvv Nils Jernletten sääʹnnǩeʹrjja Álgosátnegirji (4322 sääʹnned), leâša ååʹn tõt ââʹnn seʹst 30.000 sääʹnned da lââʹssen 6000 päiʹǩǩnõmmâd.

source: This dictionary builds on the Valtonen and Olthuis Inarinsaame-suomi-inarinsaame dictionary (30000 words).
sms: Tät sääʹnnǩeʹrjj vuâđđââvv Valtonen da Olthuis aanrõšǩiõll - lääʹdd - aanrõšǩiõll sääʹnnǩerjja (30000 sääʹnned).

source: This dictionary is based on lexical material from the Institute for the Languages of Finland, and from Giellatekno's work with the North Saami Oahpa. In addition frequent Finnish words have been added.
sms: Tän sääʹnnǩeeʹrj vuâđđan lij Kotus sannõs, da tõõzz leät lââʹzztam Giellatekno Oahpast taarbšum saaʹnid. Lââʹssen takai lääʹdd sääʹn leät lââʹzztam.

source: This dictionary is based on lexical material from the Institute for the Languages of Finland, and from Giellatekno's work with the North Saami Oahpa. In addition, we have included frequent words from North Saami.
sms: Tän sääʹnnǩeeʹrj vuâđđan lij Kotus sannõs, da tõõzz leät lââʹzztam Giellatekno Oahpast taarbšum saaʹnid. Lââʹssen takai lääʹdd sääʹn leät lââʹzztam.

source: This word is not found in our corpus
sms: Tän sääʹn jeät kaunnu korpuuzzâst

source: V
sms: veʹrbb

source: Welcome!
sms: Pueʹtted tiõrvân!

source: When you click a word here, dictionary articles appear to the right.
sms: Ko teäddlak sääʹn täʹst, eett sääʹnnǩeʹrjjartikkel vuäʹljsbeälla.

source: Write at least one letter here
sms: Ǩeeʹrjat tääzz kuuitâǥ õõut bukva

source: You can browse the search words here, new ones will be fetched until all matches have been found.
sms: Ooccâmsaaʹnid vuäinak täʹst, ođđ puäđõõzzid viiǯǯât poka puk lie kaunnum.
