Repository: divvun/satni-frontend
Catalog: src/locales/*/messages.po
Languages: fi, nb, se

source: Do searches in <0>Giellagáldu's</0> term collection, <1>Pekka Sammallahti's North Sami – Finnish dictionary</1>, Hábmer municipality's <2>Lule Sámi - Norwegian</2> or <3>Norwegian - Lule Sámi</3> medicinal dictionaries and <4>Giellatekno's</4> <5>sami dictionaries</5>.
nb: Gjør søk i <0>Giellagáldus</0> termsamling, <1>Pekka Sammalahtis nordsamisk – finsk ordbok</1>, Hamarøy kommunes <2>lulesamisk - norske</2> eller <3>norsk - lulesamiske</3> medisinordbøker eller i <4>Giellateknos</4> <5>samiske ordbøker</5>.
se: Oza <0>Giellagáldu</0> tearbmačoakkáldagas, <1>Pekka Sammallahti davvisámi – suoma sátnegirjjis</1>, Hábmera suohkana <2>julevsámi - dáro</2> dahje <3>dáro - julevsámi</3> medisiidnasátnegirjjiin dahje <4>Giellatekno</4> <5>sámi sátnegirjjiin</5>.

source: Dictionaries:
se: Sátnegirjjit:

source: north
se: davvi

source: south
se: lulli

source: Status:
se: Stáhtus:
