Repository: divvun/satni-frontend
Catalog: src/locales/*/messages.po
Languages: fi, nb, se

source: (<0>Show all</0>)
fi: (<0>Näytä kaikki</0>)
nb: (<0>Vis alle</0>)
se: (<0>Čájet visot</0>)

source: {0}/{1} languages.
fi: {0}/{1} kieltä.
nb: {0}/{1} språk.
se: {0}/{1} gielas.

source: {0}/{1} sources.
fi: {0}/{1} lähdettä.
nb: {0}/{1} kilder.
se: {0}/{1} gáldus.

source: {stemsLength}/{totalCount} containing <0>{searchExpression}</0>
fi: {stemsLength}/{totalCount} sisältää hakusanan <0>{searchExpression}</0>
nb: {stemsLength}/{totalCount} som inneholder <0>{searchExpression}</0>
se: {stemsLength}/{totalCount} mat sisttisdollet <0>{searchExpression}</0>

source: {stemsLength}/{totalCount} ending in <0>{searchExpression}</0>
fi: {stemsLength}/{totalCount} loppuu hakusanaan <0>{searchExpression}</0>
nb: {stemsLength}/{totalCount} som slutter med <0>{searchExpression}</0>
se: {stemsLength}/{totalCount} main loahppa lea <0>{searchExpression}</0>

source: {stemsLength}/{totalCount} starting with <0>{searchExpression}</0>
fi: {stemsLength}/{totalCount} alkaa hakusanalla <0>{searchExpression}</0>
nb: {stemsLength}/{totalCount} som begynner med <0>{searchExpression}</0>
se: {stemsLength}/{totalCount} main álgu lea <0>{searchExpression}</0>

source: <0>Error {0}</0>
fi: <0>Virhe {0}</0>
nb: <0>Feil {0}</0>
se: <0>Meattáhus {0}</0>

source: <0>Loading dicts …</0>
fi: <0>Ladataan sanakirjoja …</0>
se: <0>Viežžamin sátnegirjebohtosiid …</0>

source: <0>Loading terms …</0>
fi: <0>Ladataan termejä …</0>
se: <0>Viežžamin tearbmabohtosiid …</0>

source: A
fi: adj.
nb: adj.
se: adj.

source: Álšateknihkka
fi: Kuntoilutekniikka
nb: Energiteknikk

source: Approximately half of the content of the dictionary is taken by searching for parallels in a parallel corpus of administrative text. This work was financed by the Ministry of Local Government and Modernisation.
fi: Suunnilleen puolet sanakirjan sisällöstä on otettu etsimällä vastineita hallitustekstin rinnakkaiskorpuksesta. Tämän työn on rahoittanut paikallishallinnon ja modernisoinnin ministeriö.
nb: Omtrent halvparten av innholdet i ordbøkene er hentet fra et parallelkorpus av administrative tekster, finansiert av Kommunal- og administrasjonsdepartementet.
se: Sullii bealli sátnebárain leat vižžojuvvon dáru-sámi bálddalas teavsttain, ja dán barggu lea Gielda- ja guovlodepartemeanta ruhtadan.

source: Ásttoáigi ja faláštallan
fi: Urheilu ja vapaa-aika
nb: Fritid og sport
se: Astoáigi ja faláštallan

source: Ávnnasindustriija
fi: Materiaalitekniikka
nb: Råstoffindustri

source: Beaivválaš giella
fi: Arkikieli
nb: Dagligspråk

source: Boazodoallu
fi: Poronhoito
nb: Reindrift

source: Category
fi: Kategoria
nb: Kategori
se: Kategoriija

source: Choose dictionaries
fi: Valitse sanakirjoja
nb: Velg ordbøker
se: Vállje sátnegirjjiid

source: Choose languages
fi: Valitse kieliä
nb: Velg språk
se: Vállje gielaid

source: Choose whether the search expression is in the start, middle or the end of words.
fi: Valitse koskeeko haku sanojen alkua, keskiosaa vai loppua.
nb: Velg om søkeuttrykket skal være i begynnelsen, midten eller slutten av det du leter etter.
se: Vállje jus ohcancealkka galgá leat álggus, gasku dahje loahpas sániin maid ozat.

source: Click <0/> to see the inflection paradigm of words. Click <1/> to see examples of how the word is used.
fi: Valitse <0/> nähdäksesi taivutusparadigman. Valitse <1/> nähdäksesi käyttöesimerkkejä.
nb: Klikk på <0/> for å se hvordan ordet bøyes. Klikk på <1/> for å se eksempler på hvordan ordet brukes.
se: Go coahkkalat <0/>, de oainnát mo sátni sodjá. Go coahkkalat <1/>, de oainnát mo sátni lea atnon.

source: Country
fi: Maa
nb: Land
se: Riika

source: Dáidda ja girjjálašvuohta
fi: Taide ja kirjallisuus
nb: Kunst og litteratur

source: Definition
fi: Määritelmä
nb: Definisjon
se: Definišuvdna

source: Delivered by
fi: Toimittanut
nb: Laget av
se: Ráhkadeaddjit

source: Dialect
fi: Murre
nb: Dialekt
se: Suopman

source: Dictionaries
fi: Sanakirjat
nb: Ordbøker
se: Sátnegirjjit

source: Dictionary articles will appear in this pane when you press a word in the search results to the left.
fi: Sanakirja-artikkelit ilmestyvät tähän paneeliin kun sana on valittu vasemmalla olevista hakutuloksista.
nb: I dette panelet dukker det opp ordboksartikler når du trykker på et ord blant søkeresultatene til venstre.
se: Sátnegirjeartihkkalat ihtet dása go coahkkalat sáni ohcanbohtosiin dás gurut bealde.

source: Dihtorteknologiija ja diehtoteknihkka
fi: Tietojenkäsittely ja tietotekniikka
nb: Datateknologi og datateknikk

source: Eanandoallu
fi: Maatalous
nb: Jordbruk

source: Education
fi: Koulutus
nb: Undervisning
se: Oahpahus

source: Ekologiija ja biras
fi: Ekologia ja ympäristö
nb: Økologi og miljø

source: Ekonomiija ja gávppašeapmi
fi: Ekonomia ja kauppatiede
nb: Økonomi og handel

source: Emeritusprofessor Pekka Sammallahti has based this dictionary on his own printed dictionaries published in 1989 and 1993.
fi: Emeritusprofessori Pekka Sammallahti on pohjannut tämän sanakirjan itse tekemiinsä vuosien 1989 ja 1993 painettuihin sanakirjoihin.
nb: Professor emeritus Pekka Sammallahti har basert denne ordboken på sine egne trykte ordbøker som ble publisert i 1989 og 1993.
se: Emeritusprofessor Pekka Sammallahti lea čállán dán sátnegirjji iežas 1989 ja 1993 prentejuvvon sátnegirjjiid vuođul.

source: en
fi: englanti
nb: Engelsk
se: Eŋgelasgiella

source: en_genitive
fi: englannin
nb: engelsk
se: eŋgelasgiela

source: eng
fi: englanti
nb: Engelsk
se: Eŋgelasgiella

source: eng_genitive
fi: englannin
nb: engelsk
se: eŋgelasgiela

source: fi
fi: suomi
nb: Finsk
se: Suomagiella

source: FI
fi: Suomi
nb: Finland
se: Suopma

source: fi_genitive
fi: suomen
nb: finsk
se: suomagiela

source: fin
fi: suomi
nb: Finsk
se: Suomagiella

source: fin_genitive
fi: suomen
nb: finsk
se: suomagiela

source: Geografiija
fi: Maantiede
nb: Geografi

source: Gielladieđa
fi: Kielitiede
nb: Språkvitenskap

source: Giellagáldu's main task is to standardise new terminology and written language for the Sami languages. The standardised terms from their <a href="satni.uit.no/termwiki">termbase<a> is exported daily to this site, to be easily accessible to the Sami community.
fi: Giellagáldun päätehtävä on standardoida uutta termistöä saamen kielten kirjakielille. Standardoidut termit heidän <a href="satni.uit.no/termwiki">termitietokannastaan</a> tuodaan päivittäin tälle sivustolle helppokäyttöisyyttä varten.
nb: Giellagáldus hovedoppgave er normering av ny terminologi og skriftspråk for de samiske språkene. De standardiserte termene fra termbasen deres hentes daglig til dette nettstedet, slik at de er enkelt tilgjengelig for det samiske samfunnet.
se: Giellagáldu váldobargu lea ođđa terminologiija ja čállingiela normeren. Normerejuvvon tearpmat vižžojit beaivválaččat dán neahttabáikái sin <a href="satni.uit.no/termwiki">tearbmavuođus<a>, vai lea álkit ozahahtti sámi servodahkii.

source: gtfinnob
fi: Giellateknon suomi-bokmål-sanakirja
nb: Trond Trosteruds finsk – norske ordbok
se: Trond Trosteruda suoma – girjedáru sátnegirji

source: gtfinsme
fi: Giellateknon suomi–pohjoissaame-sanakirja
nb: Giellateknos finsk – nordsamisk ordbok
se: Giellatekno suoma – davvisámi sátnegirji

source: gtfinsmn
fi: Giellateknon suomi–inarinsaame-sanakirja
nb: Giellateknos finsk - enaresamisk ordbok
se: Giellatekno suoma – anársámi sátnegirji

source: gtfinsms
fi: Giellateknon suomi–koltansaame-sanakirja
nb: Giellateknos finsk – skoltesamisk ordbok
se: Giellatekno suoma – nuorttalašgiel sátnegirji

source: gtnobsma
fi: Giellateknon bokmål–eteläsaame-sanakirja
nb: Giellateknos bokmål – sørsamisk ordbok
se: Giellatekno girjedáru – lullisámi sátnegirji

source: gtnobsme
fi: Giellateknon bokmål–pohjoissaame-sanakirja
nb: Giellateknos bokmål – nordsamisk ordbok
se: Giellatekno girjedáru – davvisámi sátnegirji

source: gtnobsms
fi: Giellateknon bokmål–koltansaame-sanakirja
nb: Giellateknos bokmål – skoltesamisk ordbok
se: Giellatekno girjedáru – nuorttalašgiel sátnegirji

source: gtrussms
fi: Giellateknon venäjä–koltansaame-sanakirja
nb: Giellateknos russisk – skoltesamisk ordbok
se: Giellatekno's ruoššagiel – nuorttalašgiel sátnegirji

source: gtsmanob
fi: Giellateknon eteläsaame-bokmål-sanakirja
nb: Giellateknos sørsamisk – bokmål ordbok
se: Giellatekno lullisámi – girjedáru sátnegirji

source: gtsmefin
fi: Giellateknon pohjoissaame–suomi-sanakirja
nb: Giellateknos nordsamisk – finsk ordbok
se: Giellatekno davvisámi – suoma sátnegirji

source: gtsmenob
fi: Giellateknon pohjoissaame–bokmål-sanakirja
nb: Giellateknos nordsamisk – bokmål ordbok
se: Giellatekno davvisámi – girjedáru sátnegirji

source: gtsmesmn
fi: Giellateknon pohjoissaame–inarinsaame-sanakirja
nb: Giellateknos nordsamisk – enaresamisk ordbok
se: Giellatekno davvisámi – anársámi sátnegirji

source: gtsmnfin
fi: Giellateknon inarinsaame–suomi-sanakirja
nb: Giellateknos enaresamisk – finsk ordbok
se: Giellatekno anársámi – suoma sátnegirji

source: gtsmnsme
fi: Giellateknon inarinsaame–pohjoissaame-sanakirja
nb: Giellateknos enaresamisk – nordsamisk ordbok
se: Giellatekno anársámi – davvisámi sátnegirji

source: gtsmsfin
fi: Giellateknon koltansaame-suomi-sanakirja
nb: Giellateknos skoltesamisk - finsk ordbok
se: Giellatekno nuorttalašgiel - suoma sátnegirji

source: gtsmsnob
fi: Giellateknon koltansaame-bokmål-sanakirja
nb: Giellateknos skoltesamisk - bokmål ordbok
se: Giellatekno nuorttalašgiel - girjedáru sátnegirji

source: gtsmsrus
fi: Giellateknon koltansaame-venäjä sanakirja
nb: Giellateknos skoltesamisk - russisk ordbok
se: Giellatekno nuorttalašgiel - ruoššagiel sátnegirji

source: Gulahallanteknihkka
fi: Viestintä
nb: Kommunikasjonsteknikk

source: Guolástus
fi: Kalastus
nb: Fiskeri

source: Hábmer municipality's Lule Sámi - Norwegian medicinal dictionary. Contains about 1600 search words.
fi: Hamarøyn kunnan luulajansaame–norjan lääketieteellinen sanakirja. Sisältää noin 1600 hakusanaa.
nb: Hamarøy kommunes lulesamisk-norske medisinordbok. Inneholder ca 1600 søkeord.
se: Hábmera suohkana julevsámi - dáro medisidnasátnegirji.Sisttisdoallá sullii 1600 ohcansáni.

source: Hábmer municipality's Norwegian - Lule Sámi medicinal dictionary. Contains about 1600 search words.
fi: Hamarøyn kunnan norjan –luulajansaamen lääketieteellinen sanakirja. Sisältää noin 1600 hakusanaa.
nb: Hamarøy kommunes norsk-lulesamiske medisinordbok. Inneholder ca 1600 søkeord.
se: Hábmera suohkana dáro - julevsámi medisiidnasátnegirji.Sisttisdoallá sullii 1600 ohcansáni

source: habmernobsmj
fi: Hamarøyn bokmål–luulajansaame-lääketiedesanakirja
nb: Hamarøy kommunes norsk-lulesamiske medisinordbok
se: Hábmera suohkana dáro - julevsámi medisiidnasátnegirji

source: habmersmjnob
fi: Hamarøyn luulajansaame-bokmål-lääketiedesanakirja
nb: Hamarøy kommunes lulesamisk-norske medisinordbok
se: Hábmera suohkana julevsámi - dáro medisiidnasátnegirji

source: Help
fi: Ohje
nb: Hjelp
se: Veahkki

source: Hide this dictionary
fi: Piilota tämä sanakirja
se: Čiega dán sátnegirjji

source: Hide this language
fi: Piilota tämä kieli
se: Čiega dán giela

source: Huksenteknihkka
fi: Rakennustekniikka
nb: Begyningsteknikk

source: Inside the articles you can hide unwanted languages and dictionaries. To reactivate them, press <0/> or <1/> .
fi: Artikkelien sisältä voi poistaa ei-haluttuja kieliä tai sanakirjoja. Ne voi uudelleenaktivoida painamalla nappeja <0/> tai <1/> .
nb: Inne i artiklene kan du skjule uønskede språk og ordbøker. For å aktivere dem på nytt, trykk på <0/> eller <1/>.
se: Artihkkaliin sáhtát čiehkat gielaid dahje sátnegirjjiid maid it háliit oaidnit. Sáhtát daid čájehit fas jus coahkkalat <0/> dahje <1/>.

source: Juridihkka
fi: Lakitiede
nb: Jus

source: Languages
fi: Kielet
nb: Språk
se: Gielat

source: lat_genitive
fi: latinan
nb: latinsk
se: latiinnagiela

source: Lookup the search word
fi: Hae hakusanaa
nb: Slå opp søkeordet
se: Čájet ohcansáni bohtosa

source: Luonddudieđa ja matematihkka
fi: Luonnontieteet ja matematiikka
nb: Naturvitenskap og matematikk

source: Mášenteknihkka
fi: Laitetekniikka
nb: Maskinteknikk

source: Medisiidna
fi: Lääketiede
nb: Medisin

source: N
fi: subst.
nb: subst.
se: subst.

source: nb
fi: norjan bokmål
nb: Bokmål
se: Girjedárogiella

source: nb_genitive
fi: norjan bokmålin
nb: bokmål
se: girjedárogiela

source: nn
fi: norjan nynorsk
nb: Nynorsk
se: Ođđadárogiella

source: nn_genitive
fi: norjan nynorskin
nb: nynorsk
se: ođđadárogiela

source: nno
fi: norjan nynorsk
nb: Nynorsk
se: Ođđadárogiella

source: nno_genitive
fi: norjan nynorskin
nb: nynorsk
se: ođđadárogiela

source: NO
fi: Norja
nb: Norge
se: Norga

source: No results for <0>{searchExpression}</0>
fi: Ei tuloksia haulla <0>{searchExpression}</0>
nb: Ingen resultater for <0>{searchExpression}</0>
se: <0>{searchExpression}</0> ii gávdno sátnegirjjiin

source: nob
fi: norjan bokmål
nb: Bokmål
se: Girjedárogiella

source: nob_genitive
fi: norjan bokmålin
nb: bokmål
se: girjedárogiela

source: Norwegian → North Sámi is based on the North Sámi → Norwegian dictionary, but frequent Norwegian words have been added. It contains about 26,000 Norwegian entries.
fi: Norja→pohjoissaame perustuu pohjoissaame→norja-sanakirjaan, mitta sisältää myös yleisiä norjankielisiä sanoja. Sisältää 26 000 norjan sanaa.
nb: Norsk → Nordsamisk bygger på Nordsamisk → Norsk ordbok, men vanlige norske ord har i tillegg blitt lagt til. Den inneholder rundt 26.000 norske oppslagsord.
se: Dáru → davvisámi lea vuođđuduvvon Davvisámi → dáru sátnegirjái, muhto leat lasihan dábálaš dáru sániid. Sátnegirjjis leat oktiibuot 26,000 ohcansáni.

source: Note:
fi: Huom:
nb: Notat:
se: Notáhta:

source: Paradigm
fi: Paradigma
nb: Bøyingsmønster
se: Sojahanminsttar

source: Religion
fi: Uskonto
se: Religiovdna

source: Results for «{lemma}»
fi: Tulokset haulle {lemma}
nb: Resultat for «{lemma}»
se: «{lemma}» bohtosat

source: Results only from
fi: Tuloksia vain kohteesta
nb: Viser resultater bare fra
se: Bohtosat dušše

source: Sámi letters
fi: Saamenkieliset kirjaimet
nb: Samiske bokstaver
se: Sámi bustávat

source: sammallahtismefin
fi: Pekka Sammalahden pohjoissaame–suomi-sanakirja
nb: Pekka Sammalahtis nordsamisk – finsk ordbok
se: Pekka Sammallahti davvisámi – suoma sátnegirji

source: se
fi: pohjoissaame
nb: Nordsamisk
se: Davvisámegiella

source: SE
fi: Ruotsi
nb: Sverige
se: Ruoŧŧa

source: se_genitive
fi: pohjoissaamen
nb: nordsamisk
se: davvisámegiela

source: Search mode:
fi: Hakutila:
nb: Søkemodus:
se: Ohcanmodus:

source: Search results will appear here.
fi: Hakutulokset tulevat tähän.
nb: Søkeresultater dukker opp her.
se: Ohcanbohtosat ihtet dása.

source: Search words that contain your search term
fi: Hae sanoja jotka sisältävät hakusanan
nb: Søk etter ord som inneholder søketermen
se: Oza sániid maid sisttisdollet ohcansáni

source: Search words that end in your search term
fi: Hae sanoja jotka loppuvat hakusanaan
nb: Søk etter ord som slutter på søketermen
se: Oza sániid main loahpa lea ohcansánis

source: Search words that start with your search term
fi: Hae sanoja jotka alkavat hakusanalla
nb: Søk etter ord som begynner med søketermen
se: Oza sániid main álgu lea ohcansánis

source: Servodatdieđa
fi: Yhteiskuntatiede
nb: Samfunnsvitenskap

source: Settings
fi: Asetukset
se: Heivehusat

source: Show paradigm for this word
fi: Näytä sanan paradigma
nb: Vis bøyingsmønsteret for dette ordet
se: Čájet dán sáni sojahanminstara

source: Show this word in our corpus
fi: Näytä sana korpuksessa
nb: Vis dette ordet i tekstsamlingen vår
se: Čájet dán sáni min teakstačoakkáldagas

source: sma
fi: eteläsaame
nb: Sørsamisk
se: Lullisámegiella

source: sma_genitive
fi: eteläsaamen
nb: sørsamisk
se: lullisámegiela

source: sme
fi: pohjoissaame
nb: Nordsamisk
se: Davvisámegiella

source: sme_genitive
fi: pohjoissaamen
nb: nordsamisk
se: davvisámegiela

source: smj
fi: luulajansaame
nb: Lulesamisk
se: Julevsámegiella

source: smj_genitive
fi: luulajansaamen
nb: lulesamisk
se: julevsámegiela

source: smn
fi: inarinsaame
nb: Enaresamisk
se: Anársámegiella

source: smn_genitive
fi: inarinsaamen
nb: enaresamisk
se: anársámegiela

source: sms
fi: koltansaame
nb: Skoltesamisk
se: Nuortalašgiella

source: sms_genitive
fi: koltansaamen
nb: skoltesamisk
se: nuortalašgiela

source: Source:
fi: Lähde:
nb: Kilde:
se: Gáldu:

source: Stáda almmolaš hálddašeapmi
fi: Valtionhallinto
nb: Offentlig forvaltning
se: Almmolaš hálddašeapmi

source: sv
fi: ruotsi
nb: Svensk
se: Ruoŧagiella

source: sv_genitive
fi: ruotsin
nb: svensk
se: ruoŧagiela

source: swe
fi: ruotsi
nb: Svensk
se: Ruoŧagiella

source: swe_genitive
fi: ruotsin
nb: svensk
se: ruoŧagiela

source: Teknihkka industriija duodji
fi: Käsityöteollisuus
nb: Teknikk, industri og duodji

source: termwiki
fi: Giellagáldun monikielinen termisanasto
nb: Giellagáldus flerspråklige termer
se: Giellagáldu máŋggagielat tearpmat

source: The dictionary contains about 11,000 entries.
fi: Sanakirjassa on noin 11 000 sanaa.
nb: Ordboken har omtrent 11 000 oppslagsord.
se: Sátnegirjjis lea sullii 11 000 ohcansáni.

source: The dictionary contains more than 50.000 entries, and Sammallahti adds entries regularly.
fi: Sanakirjassa on ylu 50 000 sanaa ja Sammallahti lisää niitä päivittäin.
nb: Ordboken har mer enn 50 000 oppslagsord, og Sammallahti legger jevnlig inn nytt innhold.
se: Sátnegirjjis lea eanet go 50 000 ohcansáni, ja Sammallahti jeavddalaččat lasiha ođđa materiála.

source: The input field accepts sami, nordic, english and latin search words. If you do not have Sami letters on your device, press <0/> to write them in the input field.
fi: Syötekenttä tukee saamenkielisiä, pohjoismaisten kieten, englannin- ja latinankielisiä hakusanoja. If you do not have Sami letters on your device, press <0/> to write them in the input field.
nb: Søkefeltet forstår samiske, nordiske, engelske og latinske søkeord. Om du ikke har samiske bokstaver på maskinen din, trykk <0/> for å kunne skrive dem i søkefeltet.
se: Oza sámi, davviriikkalaš, eŋgelas dahje latiinna sániid ohcangiettis. Jus du mašiinnas eai leat sámi bustávat, coahkkal <0/> vai boalut main leat sámi bustávat ihtet.

source: The termbase consists of over 50,000 term articles, and is updated on a regular basis.
fi: Termipankissa on yli 50 000 termiartikkelia ja sitä päivitetään säännöllisesti.
nb: Termbase har over 50 000 termartikler og oppdateres jevnlig.
se: Tearbmavuođus lea badjel 50 000 artihkkala, ja ođasmahtto jeavddalaččat.

source: There is no paradigm for this word
fi: Tälle sanalle ei löydy paradigmaa
nb: Dette ordet har ikke bøyingsmønster
se: Dán sánis ii leat sojahanminsttar

source: This dictionary builds on material prepared by Albert Jåma and Tove Brustad in the Hemnes Saami Organization, but has in addition gained words from Giellatekno and Aajege's work with the Southern Sámi Oahpa.
fi: Tämä sanakirja peustuu Albert Jåman ja Tove Brustadin aineistoon Hemnesin saamelaisjärjestöltä, mutta siinä on lisäksi sanoja Giellateknon ja Aajegen eteläsaamen Oahpa-työssä lisättyjä sanoja.
nb: Denne ordboken bygger på material av Albert Jåma og Tove Brustad i Hemnes sameforening, men har i tillegg ord fra Giellateknos og Aajeges arbeid med sørsamisk Oahpa.
se: Dán sátnegirjji vuođđu lea Hemnes sámesearvvi Albert Jåma ja Tove Brustad bargu. Dasa lassin Giellatekno ja Aajege leat lasihan sániid lullisámi Oahpa ovdánahtidettiin.

source: This dictionary builds on Nils Jernsletten's dictionary Álgosátnegirji (4322 words), but now it contains 30,000 entries, plus 6000 place name entries.
fi: Sanakirja perustuu Nils Jernslettenin sanakirjaan Álgosátnegirji (4322 sanaa), kuitenkin, se sisältää nykyään yli 30 000 sanaa ja 6000 paikannimeä.
nb: Denne ordboken bygger på Nils Jernslettens ordbok Álgosátnegirji (4322 ord), men nå inneholder ordboka 31 000 oppslagsord, pluss 6000 stedsnavn.
se: Dát sátnegirji lea ráhkaduvvon Nils Jernslettena Álgosátnegirji vuođul (4322 vuođđosáni), muhto dál sátnegirji sisttisdoallá 30,000 ohcansáni, ja dasa lassin 6000 báikenama.

source: This dictionary builds on the Valtonen and Olthuis Inarinsaame-suomi-inarinsaame dictionary (30000 words).
fi: Tämä sanasto perustuu Valtosen ja Olthuisin Inarinsaame–suomi–inarinsaame-sanakirjalle (30000 sanaa).
nb: Denne ordboken bygger på Valtonen og Olthuis' Inarinsaame-suomi-inarinsaame ordbok (30 000 ord).
se: Dán sátnegirjji vuođđu lea Valtonena ja Olthuisa Inarinsaame-suomi-inarinsaame sátnegirji (30 000 ohcansáni).

source: This dictionary is based on lexical material from the Institute for the Languages of Finland, and from Giellatekno's work with the North Saami Oahpa. In addition frequent Finnish words have been added.
fi: Tämä sanakirja perustuu Kotimaisten kielten keskuksen sana-aineistoon ja siihen on lisätty Giellateknon Oahpa-kehityksessä tarvittuja sanoja. Lisäksi useita yleisiä suomalaisia sanoja on lisätty.
nb: Denne ordboken er basert på leksikalsk materiale fra Intitutionen för de inhemska språken i Finland, og fra Giellateknos arbeid med nordsamisk Oahpa. I tillegg er det lagt til vanlige finske ord.
se: Dán sátnegirjji vuođđun leat sátnelisttut «Forskingscentralen för de inhemska språken i Helsingfors»-ásahusas ja Giellatekno bargu davvisámi Oahpain. Dasa lassin dasa leat lasihuvvon dábálaš suoma sánit.

source: This dictionary is based on lexical material from the Institute for the Languages of Finland, and from Giellatekno's work with the North Saami Oahpa. In addition, we have included frequent words from North Saami.
fi: Tämä sanakirja perustuu Kotimaisten kielten keskuksen sana-aineistoon ja siihen on lisätty Giellateknon Oahpa-kehityksessä tarvittuja sanoja. Lisäksi useita yleisiä suomalaisia sanoja on lisätty.
nb: Denne ordboken er basert på leksikalsk materiale fra Intitutionen för de inhemska språken i Finland, og fra Giellateknos arbeid med nordsamisk Oahpa. I tillegg er det lagt til vanlige nordsamiske ord.
se: Dán sátnegirjji vuođđun leat sátnelisttut «Forskingscentralen för de inhemska språken i Helsingfors»-ásahusas ja Giellatekno bargu davvisámi Oahpain. Dasa lassin dasa leat lasihuvvon dábálaš davvisámi sánit.

source: This word is not found in our corpus
fi: Tätä sanaa ei löydy korpuksistamme
nb: Dette ordet finnes ikke i tekstsamlingen vår
se: Dát sátni ii gávdno min teakstačoakkáldagas

source: Trond Trosterud's Finnish – Norwegian dictionary has more than 30000 search words.
fi: Trond Trosterudin suomi–norja-sanakirja sisältää yli 30 000 hakusanaa.
nb: Trond Trosteruds finsk – norske ordbok har mer en 30000 søkeord.
se: Trond Trosteruda suoma – girjedáru sátnegirjjis leat eanet go 30000 ohcansáni.

source: V
fi: verbi
nb: verb
se: vearba

source: Welcome!
fi: Tervetuloa!
nb: Velkommen!
se: Bures boahtin!

source: When you click a word here, dictionary articles appear to the right.
fi: Kun sana valitaan täällä, sanakirja-artikkeli aukeaa oikealle.
nb: Når du klikker på et ord her, dukker ordboksartikler opp til høyre.
se: Go coahkkalat sáni dás, de sátnegirjeartihkkalat ihtet olgeš beallái.

source: Write at least one letter here
fi: Kirjoita vähintään yksi kirjain tähän
nb: Skriv minst en bokstav her
se: Čális unnimustá ovtta bustáva dása

source: You can browse the search words here, new ones will be fetched until all matches have been found.
fi: Hakusanoja voi selata tässä, uusia tuloksia haetaan kunnes kaikki on löydetty.
nb: Du kan bla blant søkeordene her, nye hentes til alle treff har blitt funnet.
se: Sáhtát bláđet ohcanbohtosiid gaskkas dás, ođđa bohtosat ihtet dassáigo visot deaivamat leat gávdnon.
