Repository: divvun/satni-frontend
Catalog: src/locales/sma/messages.po
Languages: sma

source: (<0>Show all</0>)
sma: (<0>Vuesedh gaajhkh</0>)

source: <0>Error {0}</0>
sma: <0>Båajhtede {0}</0>

source: <0>Giellagáldu</0>
sma: <0>Gïelegaaltije</0>

source: <0>Loading...</0>
sma: <0>Vïedtjeminie …</0>

source: <0>Not found</0>
sma: <0>Idtji gååvnesh</0>

source: A
sma: adj.

source: Approximately half of the content of the dictionary is taken by searching for parallels in a parallel corpus of administrative text. This work was financed by the Ministry of Local Government and Modernisation.
sma: Mahte bielie baakoepaarine vïedtjesovveme daaroe-saemien baaltelaake teekstiste, jïh dam barkoem Tjïelte- jïh regionaaledepartemeente beetnehvierhtiejgujmie dåårjeme.

source: Beaivválaš giella
sma: Biejjeladtje gïele

source: Boazodoallu
sma: Båatsoe

source: Category
sma: Kategorije

source: Choose dictionaries
sma: Veeljh baakoegærjah

source: Choose languages
sma: Veeljh gïelh

source: Click <0/> to see the inflection paradigm of words. Click <1/> to see examples of how the word is used.
sma: Gosse diedtelh <0/>, dle vuajnah guktie baakoem sojjehtidh. Gosse diedtelh <1/>, dle vuajnah guktie baakoe provhkesovveme.

source: Country
sma: Rïjhke

source: Definition
sma: Definisjovne

source: Delivered by
sma: Darjoje

source: Dialect
sma: Smaarege

source: Dictionaries
sma: Baakoegærjah

source: Dictionary articles will appear in this pane when you press a word in the search results to the left.
sma: Baakoegærjaartihkelh jijhtieh dagkoe gosse diedtelh baakoem ohtseme baakojste garrabealesne.

source: Dihtorteknologiija ja diehtoteknihkka
sma: Daatateknologije jïh daatateknigke

source: Do searches in <0>Giellagáldu's</0> term collection, <1>Pekka Sammallahti's North Sami – Finnish dictionary</1> and <2>Giellatekno's</2> <3>sami dictionaries</3>.
sma: Ohtsh <0>Gïelegaaltijen</0>teermetjåagkestahke, <1>Pekka Sammallahti noerhtesaemien - soemen baakoegærjesne</1> jïh <2>Gïeletekno</2> <3>saemien baakoegærjine</3> seammasïenten.

source: Dáidda ja girjjálašvuohta
sma: Tjiehpiesvuekieh jïh tjaaleldahkh

source: Eanandoallu
sma: Laanteburrie

source: Education
sma: Pedagogihke

source: Ekologiija ja biras
sma: Ekologije jïh voenge

source: Ekonomiija ja gávppašeapmi
sma: Ekonomije jïh åesiestimmie

source: Emeritusprofessor Pekka Sammallahti has based this dictionary on his own printed dictionaries published in 1989 and 1993.
sma: Emeritusprofessore Pekka Sammallahti tjaaleme dam baakoegærjam jïjtse 1989 jïh 1993 preenteme baakoegærjaj mïetie.

source: FI
sma: Soeme

source: Geografiija
sma: Geografije

source: Gielladieđa
sma: Gïelendotkeme

source: Giellagáldu's main task is to standardise new terminology and written language for the Sami languages. The standardised terms from their <a href="satni.uit.no/termwiki">termbase<a> is exported daily to this site, to be easily accessible to the Sami community.
sma: Gïelegaaltijen åejviebarkoe lea orre terminologijem jïh tjaelemegïelem normeredh.Normeresovveme teermh dej <a href="satni.uit.no/termwiki">teermebaseste<a> vïedtjesovva fïerhten biejjien dan nedtesæjrose, juktie aelhkebe jaksoes saemien sïebredahkese.

source: Gulahallanteknihkka
sma: Gaskesadtemeteknihke

source: Guolástus
sma: Göölemdahke

source: Help
sma: Viehkie

source: Hide this dictionary
sma: Vöörhkh dam baakoegærjam

source: Hide this language
sma: Vöörhkh dam gïelem

source: Huksenteknihkka
sma: Bigkemeteknihke

source: Inside the articles you can hide unwanted languages and dictionaries. To reactivate them, press <0/> or <1/> .
sma: Artihkelinie maahtah vöörhkedh gïelh jallh baakoegærjah maam ij sïjhth vuejnedh. Dejtie maahtah vihth vuesiehtidh jis diedtelh <0/> jallh <1/>.

source: Juridihkka
sma: Jussh

source: Languages
sma: Gïelh

source: Lookup the search word
sma: Vuesedh ohtsemebaakoem båatoem

source: Luonddudieđa ja matematihkka
sma: Eatnemedotkeme jih maatematigke

source: Medisiidna
sma: Medisijne

source: Mášenteknihkka
sma: Maasjinateknihke

source: N
sma: subst.

source: NO
sma: Nöörje

source: No results for <0>{lemma}</0>. Check <1/> or <2/> in the left menu to see if the wanted languages or dictionaries are selected.
sma: Ij naan båatoeh <0>{lemma}</0> ohtsemebaakose. Goerehth <1/> jallh <2/> jis gïelh jallh baakoegærjah mam sïjhth, veeljesovveme.

source: No results for <0>{searchExpression}</0>
sma: <0>{searchExpression}</0> ij baakoegærjine gååvnesh

source: Norwegian → North Sámi is based on the North Sámi → Norwegian dictionary, but frequent Norwegian words have been added. It contains about 26,000 Norwegian entries.
sma: Daaroen → noerhtesaemien lea baseresovveme Noerhtesaemien → daaroen baakoegærjese, men lissiehtamme sïejhme daaroen baakoeh. Baakoegærjesne 26,000 ohtsemebaakoeh.

source: Note:
sma: Notaate:

source: Ođđa sánit
sma: Orre baakoeh

source: Paradigm
sma: Sojjehtimmiemaalle

source: Religion
sma: Religijovne

source: Results only from
sma: Båatoeh ajve

source: SE
sma: Sveerje

source: Search
sma: Ohtsedh

source: Search results will appear here.
sma: Maam ohtseme jijhtieh dagkoe.

source: Servodatdieđa
sma: Sïebredahkendotkeme

source: Settings
sma: Sjïehtiesjimmieh

source: Show paradigm for this word
sma: Vuesedh dam baakoen sojjehtimmiemaallem

source: Show this word in our corpus
sma: Vuesedh dam baakoem korpusisnie

source: Source:
sma: Gaaltije

source: Start
sma: Aalkoe

source: Status:
sma: Staatuse:

source: Stáda almmolaš hálddašeapmi
sma: Byjjes reereme

source: Sámi letters
sma: Saemien bokstavh

source: Teknihkka industriija duodji
sma: Teknihke, industrije jïh vætnoeh

source: The dictionary contains about 11,000 entries.
sma: Baakoegærjesne medtie 11 000 ohtsemebaakoeh.

source: The dictionary contains more than 50.000 entries, and Sammallahti adds entries regularly.
sma: Baakoegærjesne lea jeaneb goh 50 000 ohtsemebaakoeh, jïh Sammallahti daamhtetje lissehte orre materiaalem.

source: The input field accepts sami, nordic, english and latin search words. If you do not have Sami letters on your device, press <0/> to write them in the input field.
sma: Maahtah baakoem ohtsedh saemien, noerhtelaanti, englaanten jallh latinegïelen. Jis dov faatoes saemien bokstavh dov masjijnesne, diedtelh <0/> juktie båaloeh jijhtieh mej leah saemien bokstavh.

source: The termbase consists of over 50,000 term articles, and is updated on a regular basis.
sma: Teermebasesne leah jeeneb goh 50 000 artihkelh, jïh orresten daamhtetje.

source: There is no paradigm for this word
sma: Ij naan sojjehtimmiemaalle dan baakose

source: This dictionary builds on Nils Jernsletten's dictionary Álgosátnegirji (4322 words), but now it contains 30,000 entries, plus 6000 place name entries.
sma: Dan baakoegærjan våarome lea Nils Jernslettenen Álgosátnegirji mietie (4322 madthbaakoen), men daelie baakoegærjesne 30,000 ohtsemebaakeoh, jïh lissine desnie 6000 sijjiehnommh.

source: This dictionary builds on material prepared by Albert Jåma and Tove Brustad in the Hemnes Saami Organization, but has in addition gained words from Giellatekno and Aajege's work with the Southern Sámi Oahpa.
sma: Dan baakoegærjan våarome lea barkoe maam Albert Jåma jïh Tove Brustad lægan dorjeme Hemnes saemiensiebresne. Giellatekno jïh Aajege aaj lissiehtamme åarjelsaemien baakoeh gosse barkeme Oahpa, mij åarjelsaemiengïelese.

source: This dictionary builds on the Valtonen and Olthuis Inarinsaame-suomi-inarinsaame dictionary (30000 words).
sma: Dan baakoegærjan våarome lea Valtonen jïh Olthuis Inarinsaame-suomi-inarinsaame baakoegærja (30000 baakoeh).

source: This dictionary is based on lexical material from the Institute for the Languages of Finland, and from Giellatekno's work with the North Saami Oahpa. In addition frequent Finnish words have been added.
sma: Dan baakoegærjan våarome lea baakoelæstoeh maam «Forskingscentralen för de inhemska språken i Helsingfors» tjaaleme jïh baakojste maam Giellatekno tjaaleme gosse barkeme Oahpa mij noerhtesaemien. Lissine sïejhme soemen baakoeh lissiehtamme.

source: This dictionary is based on lexical material from the Institute for the Languages of Finland, and from Giellatekno's work with the North Saami Oahpa. In addition, we have included frequent words from North Saami.
sma: "Dan baakoegærjan våarome lea baakoelæstoeh maam «Forskingscentralen för de inhemska språken i Helsingfors» tjaaleme jïh baakojste maam Giellatekno tjaaleme gosse barkeme Oahpa mij noerhtesaemien. Mijjieh aaj lissiehtamme sïejhme noerhtesaemien baakoeh.

source: This word is not found in our corpus
sma: Daate baakoe ij leah korpusisnie

source: V
sma: verbe

source: Welcome!
sma: Bueriebåeteme!

source: When you click a word here, dictionary articles appear to the right.
sma: Gosse baakoem dagkoe diedtel, baakoegærjaartihkelh jijhtieh garrabealan.

source: Write at least one letter here
sma: Tjaelel unnemes aktem bokstaavem dagka

source: You can browse the search words here, new ones will be fetched until all matches have been found.
sma: Dagkoe datne maahtah plæredh ohtsemebåatoejsne, orre båatoeh båetieh goske gaajhkh gaavneme.

source: east
sma: luvlie

source: en
sma: Englaantengïele

source: en_genitive
sma: englaantengïelen

source: eng
sma: Englaantengïele

source: eng_genitive
sma: englaantengïelen

source: fi
sma: Soemengïele

source: fi_genitive
sma: soemengïelen

source: fin
sma: Soemengïele

source: fin_genitive
sma: soemengïelen

source: gtfinnob
sma: Trond Trostedud soemen – daaroen baakeogærja

source: gtfinsme
sma: Giellatekno soemen – noerhtesaemien baakoegærja

source: gtfinsmn
sma: Giellatekno soemen – enaresaemien baakoegærja

source: gtnobsma
sma: Giellatekno daaroen – åarjelsaemien baakoegærja

source: gtnobsme
sma: Giellatekno daaroen – noerhtesaemien baakoegærja

source: gtsmanob
sma: Giellatekno åarjelsaemien – daaroen baakoegærja

source: gtsmefin
sma: Giellatekno noerhtesaemien – soemen baakoegærja

source: gtsmenob
sma: Giellatekno noerhtesaemien – daaroen baakoegærja

source: gtsmesmn
sma: Giellatekno noerhtesaemien – enaresaemien baakoegærja

source: gtsmnfin
sma: Giellatekno enaresaemien – soemen baakoegærja

source: gtsmnsme
sma: Giellatekno enaresaemien – noerhtesaemien baakoegærja

source: lat
sma: Latijnegïele

source: lat_genitive
sma: latijnegïelen

source: nb
sma: Daaaroengïele

source: nb_genitive
sma: daaroen

source: nn
sma: Orredaaroengïele

source: nn_genitive
sma: orredaaroen

source: nno
sma: Orredaaroengïele

source: nno_genitive
sma: orredaaroen

source: nob
sma: Daaroengïele

source: nob_genitive
sma: daaroen

source: north
sma: noerhte

source: sammallahtismefin
sma: Pekka Sammallahti daaroen – soemen baakeogærja

source: se
sma: Noerhtesaemiengïele

source: se_genitive
sma: noerhtesaemien

source: sma
sma: Åarjelsaemiengïele

source: sma_genitive
sma: åarjelsaemien

source: sme
sma: Noerhtesaemiengïele

source: sme_genitive
sma: noerhtesaemien

source: smj
sma: Julevsaemiengïele

source: smj_genitive
sma: julevsaemien

source: smn
sma: Enaresaemiengïele

source: smn_genitive
sma: enaresaemien

source: sms
sma: Luvliesaemiengïele

source: sms_genitive
sma: luvliesaemien

source: south
sma: åarjel

source: sv
sma: Sveerjengïele

source: sv_genitive
sma: sveerjengïelen

source: swe
sma: Sveerjengïele

source: swe_genitive
sma: sveerjengïelen

source: sámi keys
sma: saemien bokstavh

source: termwiki
sma: Gïelegaaltijen gelliegïeledh teermh

source: west
sma: jillie

source: {0}/{1} languages.
sma: {0}/{1} gïeleste.

source: {0}/{1} sources.
sma: {0}/{1} gaaltijijstie.

source: {0}/{totalCount} starting with <0>{searchExpression}</0>
sma: {0}/{totalCount} mej aalkoe lea <0>{searchExpression}</0>

source: Álšateknihkka
sma: Energiteknihke

source: Ásttoáigi ja faláštallan
sma: Eejehtse jih gaarsje

source: Ávnnasindustriija
sma: Raaveskhindustrije
