Repository: divvun/satni-frontend
Catalog: src/locales/smn/messages.po
Languages: smn

source: (<0>Show all</0>)
smn: (<0>Čääiti puoh</0>)

source: {0}/{1} languages.
smn: {0}/{1} kielâst.

source: {0}/{1} sources.
smn: {0}/{1} käldest.

source: {stemsLength}/{totalCount} containing <0>{searchExpression}</0>
smn: {stemsLength}/{totalCount} moh siskeldeh uuccâmsääni <0>{searchExpression}</0>

source: {stemsLength}/{totalCount} ending in <0>{searchExpression}</0>
smn: {stemsLength}/{totalCount} moh noheh uuccâmsáánán <0>{searchExpression}</0>

source: {stemsLength}/{totalCount} starting with <0>{searchExpression}</0>
smn: {stemsLength}/{totalCount} moh älgih uuccâmsaanijn <0>{searchExpression}</0>

source: <0>Error {0}</0>
smn: <0>Feilâ {0}</0>

source: <0>Giellagáldu</0>
smn: <0>Kielâkäldee</0>

source: A
smn: adj.

source: Álšateknihkka
smn: Energiatekniik

source: Approximately half of the content of the dictionary is taken by searching for parallels in a parallel corpus of administrative text. This work was financed by the Ministry of Local Government and Modernisation.
smn: Suullân peeli sänikirje siskáldâsâst lii valdum ucâmáin vastuid haldâttuvlij teevstâi parallelkorpusist. Taam pargo lii ruttâdâm Taažâ kieldâ- já páihálâšhaldâttuv ministeriö.

source: Ásttoáigi ja faláštallan
smn: Astoäigi já valastâllâm

source: Ávnnasindustriija
smn: Materialtekniik

source: Beaivválaš giella
smn: Jyehipiäiválâš kielâ

source: Boazodoallu
smn: Puásuituálu

source: Category
smn: Kategoria

source: Choose dictionaries
smn: Valjii sänikiirjijd

source: Choose languages
smn: Valjii kielâid

source: Choose whether the search expression is in the start, middle or the end of words.
smn: Valjii, halijdah-uv uuccâđ saanij aalgâst, kooskâst vâi loopâst.

source: Click <0/> to see the inflection paradigm of words. Click <1/> to see examples of how the word is used.
smn: Teddil <0/> vâi uáináh saanij sujâttemhaamijd. Teddil <1/> vâi uáináh kevttimovdâmeerhâid.

source: Country
smn: Eennâm

source: Dáidda ja girjjálašvuohta
smn: Taaiđâ já kirjálâšvuotâ

source: Definition
smn: Miäruštâllâm

source: Delivered by
smn: Toimâttâm

source: Dialect
smn: Kuávlukielâ

source: Dictionaries
smn: Sänikirjeh

source: Dictionaries for Skolt Saami and Finnish consist of materials based on various sources and research projects:
smn: Nuorttâlâš- já suomâkielâ sänikirjeh láá rahtum amnâstuvâin, moh vuáđuduveh maŋgáid käldeid já tutkâmhavváid:

source: Dictionaries:
smn: Sänikirjeh:

source: Dictionary articles will appear in this pane when you press a word in the search results to the left.
smn: Sänikirjeartikkâleh iteh taas, ko teddilah sääni čižetpele uuccâmpuátusijn.

source: Dihtorteknologiija ja diehtoteknihkka
smn: Tiätturteknologia já tiätutekniik

source: Do searches in <0>Giellagáldu's</0> term collection, <1>Pekka Sammallahti's North Sami – Finnish dictionary</1>, Hábmer municipality's <2>Lule Sámi - Norwegian</2> or <3>Norwegian - Lule Sámi</3> medicinal dictionaries and <4>Giellatekno's</4> <5>sami dictionaries</5>.
smn: Uusâ <0>Kielâkäldee</0> termâčuágálduvâst, <1>Pekka Sammallahti tavekielâ–suomâkielâ sänikirjeest</1>, Hábmer kieldâ <2>juulevsämikielâ–tárukielâ</2> tâi <3>tárukielâ–juulevsämikielâ</3> taalhâstiettuu sänikiirjijn and <4>Giellatekno</4> <5>sämikielâi sänikiirjijn</5>.

source: Eanandoallu
smn: Eennâmtuálu

source: Education
smn: Škovlim

source: Ekologiija ja biras
smn: Ekologia já piirâs

source: Ekonomiija ja gávppašeapmi
smn: Ekonomia já kävppitieđâ

source: Emeritusprofessor Pekka Sammallahti has based this dictionary on his own printed dictionaries published in 1989 and 1993.
smn: Emeritusprofessor Pekka Sammallahti lii čáállám taam sänikirje jieijâs 1989 já 1993 teddilum sänikiirjij vuáđuld.

source: en
smn: Eŋgâlâskielâ

source: en_genitive
smn: eŋgâlâskielâ

source: eng
smn: Eŋgâlâskielâ

source: eng_genitive
smn: eŋgâlâskielâ

source: fi
smn: Suomâkielâ

source: FI
smn: Suomâ

source: fi_genitive
smn: suomâkielâ

source: fin
smn: Suomâkielâ

source: fin_genitive
smn: suomâkielâ

source: Geografiija
smn: Eennâmtieđâ

source: Gielladieđa
smn: Kielâtieđâ

source: Giellagáldu's main task is to standardise new terminology and written language for the Sami languages. The standardised terms from their <a href="satni.uit.no/termwiki">termbase<a> is exported daily to this site, to be easily accessible to the Sami community.
smn: Kielâkäldee váldupargon lii uđđâ terminologia já čäällimkielâ normâdem. Normâdum teermah viäžžojeh jyehi peeivi sii <a href="satni.uit.no/termwiki">termâtiätuvuáđust<a> taan siijđon, vâi taid lii älkkee uuccâđ já kevttiđ.

source: gtfinnob
smn: Trond Trosterud suomâkielâ–kirjetárukielâ sänikirje

source: gtfinsme
smn: Giellatekno suomâkielâ–tavesämikielâ sänikirje

source: gtfinsmn
smn: Giellatekno suomâkielâ–anarâškielâ sänikirje

source: gtfinsms
smn: Giellatekno suomâkielâ–nuorttâlâškielâ sänikirje

source: gtnobsma
smn: Giellatekno kirjetárukielâ–maadâsämikielâ sänikirje

source: gtnobsme
smn: Giellatekno kirjetárukielâ–tavesämikielâ sänikirje

source: gtnobsms
smn: Giellatekno kirjetárukielâ–nuorttâlâškielâ sänikirje

source: gtrussms
smn: Giellatekno ruošâkielâ–nuorttâlâškielâ sänikirje

source: gtsmanob
smn: Giellatekno maadâsämikielâ–kirjetárukielâ sänikirje

source: gtsmefin
smn: Giellatekno tavesämikielâ–suomâkielâ sänikirje

source: gtsmenob
smn: Giellatekno tavesämikielâ–kirjetárukielâ sänikirje

source: gtsmesmn
smn: Giellatekno tavesämikielâ–anarâškielâ sänikirje

source: gtsmnfin
smn: Giellatekno anarâškielâ–suomâkielâ sänikirje

source: gtsmnsme
smn: Giellatekno anarâškielâ–tavesämikielâ sänikirje

source: gtsmsfin
smn: Giellatekno nuorttâlâškielâ–suomâkielâ sänikirje

source: gtsmsnob
smn: Giellatekno nuorttâlâškielâ–kirjetárukielâ sänikirje

source: gtsmsrus
smn: Giellatekno nuorttâlâškielâ–ruošâkielâ sänikirje

source: Gulahallanteknihkka
smn: Viestâdem

source: Guolástus
smn: Kuálástem

source: Hábmer municipality's Lule Sámi - Norwegian medicinal dictionary. Contains about 1600 search words.
smn: Hábmer kieldâ juulevsämikielâ–tárukielâ talhâstiettuu sänikirje. Siskeeld suullân 1600 säännid.

source: Hábmer municipality's Norwegian - Lule Sámi medicinal dictionary. Contains about 1600 search words.
smn: Hábmer kieldâ tárukielâ–juulevsämikielâ talhâstiettuu sänikirje. Siskeeld suullân 1600 säännid.

source: habmernobsmj
smn: Hábmer kieldâ kirjetárukielâ–juulevsämikielâ talhâstiettuu sänikirje

source: habmersmjnob
smn: Hábmer kieldâ juulevsämikielâ–kirjetárukielâ talhâstiettuu sänikirje

source: Help
smn: Iše

source: Huksenteknihkka
smn: Huksimtekniik

source: In June of 2020, the files generated by Jack Rueter (approximately 30000 entries) were moved into main/words/dicts/finsms/inc/ for future consultation. The files have been replaced by a newer set (approximately 20000 entries) deriving directly from editing of the Satu & Jouni Moshnikoff dictionary organized by the Oulu University Giellagas Institute and Saami Parliament in Inari, Finland with funding from the Finnish Ministry of Education (2019–2020).
smn: Kesimáánust 2020 Jack Rueter rähtim tiätuvuárháh (suullân 30 000 säännid) sirdojii ucâttâhân main/words/dicts/finsms/inc/ maŋelub suogârdâllâm várás. Tiätuvuárhái sajan lii pieijum uđđâsub amnâstâh (suullân 20 000 säännid), mii lii valdum njuolgâ Satu & Jouni Moshnikoff sänikirjeest. Sänikirje kađvâmpargo láá čođâldittám Oulu ollâopâttuv Giellagas-instituut já Suomâ Sämitigge já tom lii ruttâdâm máttááttâsministeriö (2019–2020).

source: Inside the articles you can hide unwanted languages and dictionaries. To reactivate them, press <0/> or <1/> .
smn: Artikkâlij siste puáhtá čiehâđ kielâid tâi sänikiirjijd, maid jieh haalijd uáiniđ. Finniih taid maasâd uáinusân ko teddilah <0/> tâi <1/> .

source: Juridihkka
smn: Lahâtieđâ

source: Language memory was (officially) installed in 2018, but the project with the wordlist and recordings by Espen Sommer Eide was begun in 2009.
smn: Kielâmušto stellejui (virgálávt) ive 2018, mut jieš haavâ sänilistoin já paddiimijguin algâttij Espen Sommer Eide ive 2009.

source: Languages
smn: Kielah

source: lat_genitive
smn: läättinkielâ

source: Lookup the search word
smn: Uusâ uuccâmsääni

source: Luonddudieđa ja matematihkka
smn: Luándutieđâ já matematiik

source: Mášenteknihkka
smn: Maašintekniik

source: Medisiidna
smn: Talhâstieđâ

source: N
smn: subst.

source: nb
smn: Kirjetárukielâ

source: nb_genitive
smn: kirjetárukielâ

source: nn
smn: Uđđâtárukielâ

source: nn_genitive
smn: uđđâtárukielâ

source: nno
smn: Uđđâtárukielâ

source: nno_genitive
smn: uđđâtárukielâ

source: NO
smn: Taažâ

source: No results for <0>{searchExpression}</0>
smn: Ucâmáin <0>{searchExpression}</0> iä kavnuu puátuseh

source: nob
smn: Kirjetárukielâ

source: nob_genitive
smn: kirjetárukielâ

source: Norwegian → North Sámi is based on the North Sámi → Norwegian dictionary, but frequent Norwegian words have been added. It contains about 26,000 Norwegian entries.
smn: Tárukielâ–tavesämikielâ sänikirje vuáđuduvá tavesämikielâ–tárukielâ sänikiirján, mut toos láá lasettum táváliih tárukielâ säänih. Tot siskeeld suullân 26 000 tárukiel säännid.

source: Note:
smn: Huám:

source: Other main contributors to these projects were (in alphabetical order) Katri Jefremoff, Erkki Lumisalmi, Zoja Nosova, Lena Terhart, and Joshua Wilbur.
smn: Eres tai haavâi válduovdedeijeeh láá lamaš (puustavoornigist) Katri Jefremoff, Erkki Lumisalmi, Zoja Nosova, Lena Terhart já Joshua Wilbur.

source: Paradigm
smn: Sujâttemhäämih

source: Religion
smn: Oskoldâh

source: Results for «{lemma}»
smn: Uuccâm «{lemma}» puátuseh

source: Results only from
smn: Puátuseh tuše

source: rus
smn: Ruošâkielâ

source: Sámi letters
smn: Sämipustaveh

source: sammallahtismefin
smn: Pekka Sammallahti tavesämikielâ–suomâkielâ sänikirje

source: Satu & Jouni Moshnikoff sanasto
smn: Satu & Jouni Moshnikoff sánádâh

source: se
smn: Tavesämikielâ

source: SE
smn: Ruotâ

source: se_genitive
smn: tavesämikielâ

source: Search mode:
smn: Uuccâmvyehi:

source: Search results will appear here.
smn: Uuccâmpuátuseh uáinojeh täst.

source: Search words that contain your search term
smn: Uusâ sääni, mii siskeeld uuccâmsääni

source: Search words that end in your search term
smn: Uusâ sääni, mii nohá uuccâmsáánán

source: Search words that start with your search term
smn: Uusâ sääni, mii álgá uuccâmsaanijn

source: Servodatdieđa
smn: Ohtsâškoddetieđâ

source: Show paradigm for this word
smn: Čääiti taan sääni sujâttemhaamijd

source: Show this word in our corpus
smn: Čääiti taam sääni korpusist

source: Skolt Sámi → X project contains materials deriving from the research of numerous projects, dictionaries and word lists.
smn: Nuorttâlâškielâ → X haahâ siskeeld amnâstuvâid, moh láá vuálgus maaŋgâi jieškote-uv haavâi tutkâmušâst, sänikiirjijn já sänilistoin.

source: Skolt Sámi lemmas with Finnish translations can also be attributed to materials in:
smn: Nuorttâlâškielâ lemmah suomâkiel jurgâlusâiguin láá nurrum meid tain amnâstuvâin:

source: sma
smn: Maadâsämikielâ

source: sma_genitive
smn: maadâsämikielâ

source: sme
smn: Tavesämikielâ

source: sme_genitive
smn: tavesämikielâ

source: smj
smn: Juulevsämikielâ

source: smj_genitive
smn: juulevsämikielâ

source: smn
smn: Anarâškielâ

source: smn_genitive
smn: anarâškielâ

source: sms
smn: Nuorttâlâškielâ

source: sms_genitive
smn: nuorttâlâškielâ

source: Source:
smn: Käldee:

source: Stáda almmolaš hálddašeapmi
smn: Almoshaldâttâh

source: Subsequent updating of these files is being continued using the Veʹrdd dictionary editing platform, which played an instrumental role in the development of 2020.
smn: Tai tiätuvuárhái peividem juátkoo puátteevuođâst Veʹrdd-sänikirje editistemvuáláást, mast lâi tehálâš rooli ovdedempargoost ive 2020.

source: Subsequent updating of these files is being continued using the Veʹrdd dictionary editing platform, which played an instrumental role in the development of 2020. Extensive work can be attributed to members of the language community, language researchers and students at the Giellagas Institute and language technology researchers.
smn: Tai tiätuvuárhái peividem juátkoo puátteevuođâst Veʹrdd-sänikirje editistemvuáláást, mast lâi tehálâš rooli ovdedempargoost ive 2020. Taam stuorrâ pargo láá porgâm kielâsiärváduv jesâneh, Giellagas-instituut kielâtotkeeh já uáppeeh já kielâteknologia totkeeh.

source: sv
smn: Ruotâkielâ

source: sv_genitive
smn: ruotâkielâ

source: swe
smn: Ruotâkielâ

source: swe_genitive
smn: ruotâkielâ

source: Teknihkka industriija duodji
smn: Tekniik, ráhtulâšvuotâ já kietâtyeji

source: termwiki
smn: Kielâkäldee maaŋgâkielâlâš termâčuágáldâh

source: The creation of this wordlist was related to the Kola Sámi Documentation Project (KSDP) led by Michael Rießler, to work carried out by Michael Rießler at Äʹvv Saaʹmi muʹzei, as well as the art installation "Language Memory" at Äʹvv Saaʹmi muʹzei by Espen Sommer Eide.
smn: Taan sänilisto rähtim lohtâsij Kuáláduv sämikielâi dokumentaatiohaahân (Kola Sámi Documentation Project, KSDP), mon jođettij Michael Rießler, Michael Rießler porgâm paargon Äʹvv Saaʹmi museost sehe Espen Sommer Eide taaiđâinstallaation "Language Memory" Äʹvv Saaʹmi museost.

source: The dictionary contains about 11,000 entries.
smn: Sänikirje siskeeld suullân 11 000 uuccâmsäännid.

source: The dictionary contains more than 50.000 entries, and Sammallahti adds entries regularly.
smn: Sänikirje siskeeld eenâb ko 50 000 säännid, já Sammallahti lasseet toos material merikoskâsávt.

source: The Finnish-to-Skolt Sami dictionary has gone through three phases, moving from quantity to quality. After original work with in the Skolt Sami-to-X dictionary, a simple flipped dictionary was produced for providing Finnish-to-Skolt Sami searches in the saan.oahpa.no online dictionary in 2016.
smn: Suomâkielâ - nuorttâlâškielâ sänikirje lii moonnâm čoođâ kulmâ mudo, meereest kvaliteetân. Algâalgâlii nuorttâlâškielâ - X sänikirjepargo maŋa valmâštui oovtâkiärdánis sänikirje nube suundán, já toin lâi máhđulâš uuccâđ suomâkielâst nuorttâlâškielân saan.oahpa.no-nettisänikirjeest ive 2016.

source: The input field accepts sami, nordic, english and latin search words. If you do not have Sami letters on your device, press <0/> to write them in the input field.
smn: Uuccâmkiädán puáhtá čäälliđ sämikielâi, skandinaavlij kielâi, eŋgâlâskielâ já läättinkielâ uuccâmsaanijd. Jis tust váiluh sämipustaveh, te teddil <0/> te iteh puáluh, moiguin puávtáh čäälliđ taid.

source: The KSDP started in 2005 and in principle is still active.
smn: KSDP algâttui ive 2005 já tot lii vuáđujurdust ain aktiivlâš.

source: The present Finnish-to-Skolt Sami dictionary consists of approximately 20000 entries, which are derived directly from editing of the Satu & Jouni Moshnikoff dictionary organized by the Oulu University Giellagas Institute and Saami Parliament in Inari, Finland with funding from the Finnish Ministry of Education (2019–2020).
smn: Tááláš suomâkielâ–nuorttâlâškielâ sänikirje siskeeld suullân 20 000 säännid, moh láá valdum njuolgâ Satu & Jouni Moshnikoff sänikirjeest. Taam sänikirjepargo ornijn Oulu ollâopâttuv Giellagas-instituut já Suomâ Sämitigge já tom ruttâdij máttááttâsministeriö (2019–2020)

source: The research projects have lead to the merging of several word lists featuring Skolt Sami as a source language with multiple target languages. Michael Rießler's contribution mainly consists of the integration of an earlier created Skolt Saami word list with English, Finnish, Norwegian, and Russian translations and linking to sound files.
smn: Tutkâmhaavâ puáđusin láá ovtâstittum maŋgâ sänilisto, main nuorttâlâškielâ lii vuolgâkiellân já eres kielah čuosâttâhkiellân. Michael Rießler roolin lii iänááš lamaš ovdebij nuorttâlâškielâ sänilistoi ovtâstittem eŋgâlâskielâ, suomâkielâ, tárukielâ já ruošâkielâ jurgâlusâiguin já liiŋkâi rähtim jienâtiätuvuárháid.

source: The termbase consists of over 50,000 term articles, and is updated on a regular basis.
smn: Termâčuágáldâh siskeeld paijeel 50 000 termâartikkâlid já tot peividuvvoo merikoskâsávt.

source: There is no paradigm for this word
smn: Taan sáánán ij kavnuu sujâttemmyenster

source: This dictionary builds on material prepared by Albert Jåma and Tove Brustad in the Hemnes Saami Organization, but has in addition gained words from Giellatekno and Aajege's work with the Southern Sámi Oahpa.
smn: Taat sänikirje vuáđuduvá Hemnes sämiseervi Albert Jåma ja Tove Brustad amnâstâhân, mut tot lii vala lasseen finnim saanijd Giellateknost já Aajege maadâsämikielâ Oahpa-pargoost.

source: This dictionary builds on Nils Jernsletten's dictionary Álgosátnegirji (4322 words), but now it contains 30,000 entries, plus 6000 place name entries.
smn: Taat sänikirje vuáđuduvá Nils Jernsletten Álgosátnegirji-sänikiirján (4322 säännid), mut tot siskeeld tääl 30 000 säännid já toi lasseen 6000 päikkinommâd.

source: This dictionary builds on the Valtonen and Olthuis Inarinsaame-suomi-inarinsaame dictionary (30000 words).
smn: Taat sänikirje vuáđuduvá Valtosii já Olthuis säämi–suomâ–säämi sänikiirján (30 000 säännid).

source: This dictionary is based on lexical material from the Institute for the Languages of Finland, and from Giellatekno's work with the North Saami Oahpa. In addition frequent Finnish words have been added.
smn: Taat sänikirje vuáđuduvá Päikkieennâm kielâi kuávdáá (Kotus) säniamnâstâhân já Giellatekno tavesämikielâ Oahpa-sánádâhân. Ton lasseen toos láá lasettum táváliih suomâkielâ säänih.

source: This dictionary is based on lexical material from the Institute for the Languages of Finland, and from Giellatekno's work with the North Saami Oahpa. In addition, we have included frequent words from North Saami.
smn: Taat sänikirje vuáđuduvá Päikkieennâm kielâi kuávdáá (Kotus) säniamnâstâhân já Giellatekno tavesämikielâ Oahpa-sánádâhân. Ton lasseen toos láá lasettum táváliih tavesämikielâ säänih.

source: This word is not found in our corpus
smn: Taat sääni ij kavnuu mii korpusist

source: This, of course, meant that an extensive amount of non-standard words and word forms were presented. As more and more students of the language became aware of the dictionary, it began to serve as a basis of vocabulary learning and, unfortunately, the source of many spelling mistakes and morphological misconceptions.
smn: Taat merhâšij tiäđust-uv tom, et puohtui oovdân stuorrâ meeri noormâvuástásijd saanijd já sänihaamijd. Ko eenâb já eenâb kielâuáppeeh ožžuu tiettiđ sänikirjeest, te tast šoodâi vuáđu sánáduv oppâmân já vaidâlittee kale maaŋgâi čäällimfeeilâi já hämiopâlij puástuibárdâsâi käldee.

source: Trond Trosterud's Finnish – Norwegian dictionary has more than 30000 search words.
smn: Trond Trosterud suomâkielâ–tárukielâ sänikirje siskeeld paijeel 30 000 uuccâmsäännid.

source: V
smn: verbâ

source: Welcome!
smn: Tiervâpuáttim!

source: When you click a word here, dictionary articles appear to the right.
smn: Ko teddilah sääni täst, te sänikirjeartikkâleh lekkâseh uálgispel.

source: Write at least one letter here
smn: Čääli taas aainâs-uv oovtâ puustav

source: You can browse the search words here, new ones will be fetched until all matches have been found.
smn: Täst tun puávtáh laađđâđ uuccâmsaanijd. Uđđâ puátuseh viäžžojeh tassaaš ko puoh láá kavnum.
