Repository: divvun/satni-frontend
Catalog: src/locales/smj/messages.po
Languages: smj

source: (<0>Show all</0>)
smj: (<0>Vuoseda divna</0>)

source: <0>Error {0}</0>
smj: <0>Vihke {0}</0>

source: <0>Giellagáldu</0>
smj: <0>Giellagálldo</0>

source: <0>Loading dicts …</0>
smj: <0>Viedtjamin báhkogirjjebåhtusijt …</0>

source: <0>Loading terms …</0>
smj: <0>Viedtjamin tærmmabåhtusijt …</0>

source: A
smj: adj.

source: Approximately half of the content of the dictionary is taken by searching for parallels in a parallel corpus of administrative text. This work was financed by the Ministry of Local Government and Modernisation.
smj: Birrusij bielle báhkopárajs li viettjaduvvam dáro-sáme buohtalasj tevstajs, ja dav bargov la Suohkan- ja háldadimdepatemænnta ruhtadam

source: Beaivválaš giella
smj: Bæjválasj giella

source: Boazodoallu
smj: Boatsojæládus

source: Category
smj: Kategorijja

source: Choose dictionaries
smj: Vállji báhkogirjijt

source: Choose languages
smj: Vállji gielajt

source: Choose whether the search expression is in the start, middle or the end of words.
smj: Vállji jus åhtsåmbáhko galggá liehket bágo álgon, sinna jali låhpan.

source: Click <0/> to see the inflection paradigm of words. Click <1/> to see examples of how the word is used.
smj: Gå diebttjista <0/> de vuojná gåktu báhko såjåduvvá. Gå diebttjista <1/> de vuojná gåk báhko l anon tevstajn.

source: Country
smj: Rijka

source: Definition
smj: Definisjåvnnå

source: Delivered by
smj: Dahkke

source: Dialect
smj: Giellasuorgge

source: Dictionaries
smj: Báhkogirje

source: Dictionary articles will appear in this pane when you press a word in the search results to the left.
smj: Báhkogirjjeartihkkala ihti dási gå diebttjista bágov åhtsåmbåhtusijn gårobielen

source: Dihtorteknologiija ja diehtoteknihkka
smj: Dáhtáteknologijja ja dáhtáteknihkka

source: Do searches in <0>Giellagáldu's</0> term collection, <1>Pekka Sammallahti's North Sami – Finnish dictionary</1>, Hábmer municipality's <2>Lule Sámi - Norwegian</2> or <3>Norwegian - Lule Sámi</3> medicinal dictionaries and <4>Giellatekno's</4> <5>sami dictionaries</5>.
smj: Åtså <0>Giellagáldo</0> tærmmatjoakkáldagán, <1>Pekka Sammallahtiha Nuorttasáme - Suoma báhkogirjen</1>, Hábmera suohkana <2>Julevsáme - Dáro</2> jali <3>Dáro - Julevsáme</3> medisijnalasj báhkogirjijn ja <4>Giellatekno</4> <5>sáme báhkogirjijn</5>

source: Dáidda ja girjjálašvuohta
smj: Dájddá ja girjálasjvuohta

source: Eanandoallu
smj: Ednamæládus

source: Education
smj: Pedagogihkka

source: Ekologiija ja biras
smj: Økologijja ja birás

source: Ekonomiija ja gávppašeapmi
smj: Økonomijja ja oasestibme

source: Emeritusprofessor Pekka Sammallahti has based this dictionary on his own printed dictionaries published in 1989 and 1993.
smj: Emeritusprofæssor Pekka Sammallahti la tjállám dáv báhkogirjev ietjas 1989 ja 1993 prienntiduvvam báhkogirjij vuodon.

source: FI
smj: Suobma

source: Geografiija
smj: Geografijja

source: Gielladieđa
smj: Gielladieda

source: Giellagáldu's main task is to standardise new terminology and written language for the Sami languages. The standardised terms from their <a href="satni.uit.no/termwiki">termbase<a> is exported daily to this site, to be easily accessible to the Sami community.
smj: Giellagáldo oajvvebarggo la ådå teminologijja ja tjállemgielav normierit. Normieriduvvam terma viettjaduvvi bæjválattjat Giellagáldo <a href="satni.uit.no/termwiki">tærmmavuorkás<a>, váj galggá álkke sáme sebrudahkaj dajt gávnnat.

source: Gulahallanteknihkka
smj: Guládallamteknihkka

source: Help
smj: Viehkke

source: Hide this dictionary
smj: Tjiega dáv báhkogirjev

source: Hide this language
smj: Tjiega dáv gielav

source: Huksenteknihkka
smj: Biggimteknihkka

source: Hábmer municipality's Lule Sámi - Norwegian medicinal dictionary. Contains about 1600 search words.
smj: Hábmera suohkana julevsáme - dáro medisijnalasj báhkogirjje. Birrusij 1600 åhtsåmbágo.

source: Hábmer municipality's Norwegian - Lule Sámi medicinal dictionary. Contains about 1600 search words.
smj: Hábmera suohkana dáro - julevsáme medisijnalasj báhkogirjje. Birrusij 1600 åhtsåmbágo.

source: Inside the articles you can hide unwanted languages and dictionaries. To reactivate them, press <0/> or <1/> .
smj: Artihkkalijn máhtá tjiehkat gielajt jali báhkogirjijt majt i sidá vuojnnet. Jus vas sidá dajt vuojnnet de diebttjista <0/> jali <1/> .

source: Languages
smj: Giela

source: Lookup the search word
smj: Vuoseda åhtsåmbágo båhtusijt

source: Luonddudieđa ja matematihkka
smj: Luonddodiehtaga ja matematihkka

source: Medisiidna
smj: Medisijnna

source: Mášenteknihkka
smj: Masjijnnateknihkka

source: N
smj: subst.

source: NO
smj: Vuodna

source: No results for <0>{searchExpression}</0>
smj: <0>{searchExpression}</0> ij gávnnu báhkogirjijn

source: Norwegian → North Sámi is based on the North Sámi → Norwegian dictionary, but frequent Norwegian words have been added. It contains about 26,000 Norwegian entries.
smj: Dáro → nuorttasáme báhkogirjje l vuododuvvam Nuorttasáme → dáro báhkogirjjáj, duodden lip lasedam dábálasj dárobágojt. Báhkogirjen li tjoahkkáj 26,000 åhtsåbágo

source: Note:
smj: Notáhta:

source: Ođđa sánit
smj: Ådå bágo

source: Paradigm
smj: Såjådimminstar

source: Religion
smj: Relijåvnnå

source: Results for «{lemma}»
smj: «{lemma}» båhtusa

source: Results only from
smj: Båhtusa dåssju

source: SE
smj: Svierik

source: Search
smj: Åtså

source: Search mode
smj: Åhtsåmmodus

source: Search mode:
smj: Åhtsåmmodus:

source: Search results will appear here.
smj: Åhtsåmbåhtusa ihti dási

source: Search words that contain your search term
smj: Åtså bágojt gånnå åhtsåmbáhko l bágo sinna

source: Search words that end in your search term
smj: Åtså bágojt gånnå åhtsåmbáhko l bágo låhpan

source: Search words that start with your search term
smj: Åtså bágojt gånnå åhtsåmbáhko l bágo álgon

source: Servodatdieđa
smj: Sebrudakdiehtaga

source: Settings
smj: Hiebadibme

source: Show paradigm for this word
smj: Vuoseda dán bágo såjådimev

source: Show this word in our corpus
smj: Vuoseda dáv bágo tækstatjoakkáldagán

source: Source:
smj: Gálldo

source: Stáda almmolaš hálddašeapmi
smj: Almulasj háldadus

source: Sámi letters
smj: Sáme bokstáva

source: Teknihkka industriija duodji
smj: Teknihkka, industrijja ja duodje

source: The dictionary contains about 11,000 entries.
smj: Báhkogirjen li birrusij 11,000 åhtsåmbágo

source: The dictionary contains more than 50.000 entries, and Sammallahti adds entries regularly.
smj: Báhkogirjen li ienep gå 50.000 åhtsåmbágo, ja Sammallahti juovnnát laset ådå materiálav

source: The input field accepts sami, nordic, english and latin search words. If you do not have Sami letters on your device, press <0/> to write them in the input field.
smj: Máhtá åhtsåt sáme, nuorttarijkalasj, ieŋŋils jali latijna bágojt. Jus dujna ælla sáme bokstáva, diebttjista <0/> váj boalo majn li sáme bokstáva ihtit.

source: The termbase consists of over 50,000 term articles, and is updated on a regular basis.
smj: Tærmmavuorkán li badjel 50,000 artihkkala, and ådåsmáhteduvvá juovnnát

source: There is no paradigm for this word
smj: Dán báhkuj ij la dagádum såjådibme

source: This dictionary builds on Nils Jernsletten's dictionary Álgosátnegirji (4322 words), but now it contains 30,000 entries, plus 6000 place name entries.
smj: Vuodon dán báhkogirjjáj la Nils Jernslettena báhkogirjje Álgosátnegirji (4322 bágoj), valla dálla li tjoahkkáj 30,000 åhtsåmbágo, ja duodden 6000 bájkkenammartihkkala.

source: This dictionary builds on material prepared by Albert Jåma and Tove Brustad in the Hemnes Saami Organization, but has in addition gained words from Giellatekno and Aajege's work with the Southern Sámi Oahpa.
smj: Vuodon dán báhkogirjjáj la Hemnesa sámesiebre Albert Jåma ja Tove Brustada barggo. Duodden dasi la Giellatekno ja Aajege lasedam bágojt oarjjelsáme Åhpa åvddånahttemis.

source: This dictionary builds on the Valtonen and Olthuis Inarinsaame-suomi-inarinsaame dictionary (30000 words).
smj: Vuodon dán báhkogirjjáj la Valtonena ja Olthuisa Anársáme-suoma-anársáme báhkogirjje (30,000 bágoj)

source: This dictionary is based on lexical material from the Institute for the Languages of Finland, and from Giellatekno's work with the North Saami Oahpa. In addition frequent Finnish words have been added.
smj: Vuodon dán báhkogirjjáj li báhkolista «Forskingscentralen för de inhemska språken i Helsingfors»-ásadusás ja Giellatekno bargos nuorttasáme Åhpajn. Duodden lip lasedam dábálasj bágojt suomagielas

source: This dictionary is based on lexical material from the Institute for the Languages of Finland, and from Giellatekno's work with the North Saami Oahpa. In addition, we have included frequent words from North Saami.
smj: Vuodon dán báhkogirjjáj li báhkolista «Forskingscentralen för de inhemska språken i Helsingfors»-ásadusás ja Giellatekno bargos nuorttasáme Åhpajn. Duodden lip lasedam dábálasj bágojt nuorttasámegielas

source: This word is not found in our corpus
smj: Dát báhko ij lim tækstatjoakkáldagán

source: Trond Trosterud's Finnish – Norwegian dictionary has more than 30000 search words.
smj: Trond Trosteruda suoma – dáro báhkogirjen li ienep gå 30000 åhtsåmbágo.

source: V
smj: værbba

source: Welcome!
smj: Buorisboahtem!

source: When you click a word here, dictionary articles appear to the right.
smj: Gå diebttjista bágov dánna, de báhkogirjjeartihkal ihtá oalgesbælláj

source: Write at least one letter here
smj: Tjállela binnemusát avtav bokstávav diek

source: You can browse the search words here, new ones will be fetched until all matches have been found.
smj: Dánna besa sláddit åhtsåmbåhtusij gaskan, ådå båhtusa ihti nav guhkev gå gávnná ådå båhtusijt

source: east
smj: nuortto

source: en
smj: Ieŋŋilsgiella

source: en_genitive
smj: ieŋŋilsgiela

source: eng
smj: Ieŋŋilsgiella

source: eng_genitive
smj: ieŋŋilsgiela

source: fi
smj: Suomagiella

source: fi_genitive
smj: suomagiela

source: fin
smj: Suomagiella

source: fin_genitive
smj: suomagiela

source: gtfinnob
smj: Trond Trosterud suoma – girjjedáro báhkogirjje

source: gtfinsme
smj: Giellatekno suoma – nuorttasáme báhkogirjje

source: gtfinsmn
smj: Giellatekno suoma – anársáme báhkogirjje

source: gtfinsms
smj: Giellatekno suoma – lullesáme báhkogirjje

source: gtnobsma
smj: Giellatekno girjjedáro – oarjjelsáme báhkogirjje

source: gtnobsme
smj: Giellatekno girjjedáro – nuorttasáme báhkogirjje

source: gtnobsms
smj: Giellatekno girjjedáro – lullesáme báhkogirjje

source: gtrussms
smj: Giellatekno gárjjel – lullesáme báhkogirjje

source: gtsmanob
smj: Giellatekno oarjjelsáme – girjjedáro báhkogirjje

source: gtsmefin
smj: Giellatekno nuorttasáme – suoma báhkogirjje

source: gtsmenob
smj: Giellatekno nuorttasáme – girjjedáro báhkogirjje

source: gtsmesmn
smj: Giellatekno nuorttasáme – anársáme báhkogirjje

source: gtsmnfin
smj: Giellatekno anársáme – suoma báhkogirjje

source: gtsmnsme
smj: Giellatekno anársáme – nuorttasáme báhkogirjje

source: gtsmsfin
smj: Giellatekno lullesáme – suoma báhkogirjje

source: gtsmsnob
smj: Giellatekno lullesáme – girjjedáro báhkogirjje

source: gtsmsrus
smj: Giellatekno lullesáme – gárjjel báhkogirjje

source: habmernobsmj
smj: Hábmera suohkana dáro - julevsáme medisijnalaj báhkogirjje.

source: habmersmjnob
smj: Hábmera suohkana julevsáme - dáro medisijnalaj báhkogirjje.

source: lat
smj: Latijnagiella

source: lat_genitive
smj: latijnagiela

source: nb
smj: Girjjedárogiella

source: nb_genitive
smj: girjjedárogiela

source: nn
smj: Ådådárogiella

source: nn_genitive
smj: ådådárogiela

source: nno
smj: Ådådárogiella

source: nno_genitive
smj: ådådárogiela

source: nob
smj: Girjjedárogiella

source: nob_genitive
smj: girjjedárogiela

source: north
smj: nuortta

source: sammallahtismefin
smj: Pekka Sammallahti nuorttasáme – suoma báhkogirjje

source: se
smj: Nuorttasámegiella

source: se_genitive
smj: nuorttasámegiela

source: sma
smj: Oarjjelsámegiella

source: sma_genitive
smj: oarjjelsámegiela

source: sme
smj: Nuorttasámegiella

source: sme_genitive
smj: nuorttasámegiela

source: smj
smj: Julevsámegiella

source: smj_genitive
smj: julevsámegiela

source: smn
smj: Anársámegiella

source: smn_genitive
smj: anársámegiela

source: sms
smj: Gålldåsámegiella

source: sms_genitive
smj: gålldåsámegiela

source: south
smj: oarjjel

source: sv
smj: Svierigadárogiella

source: sv_genitive
smj: svierigadárogiela

source: swe
smj: Svierigadárogiella

source: swe_genitive
smj: svierigadárogiela

source: sámi keys
smj: Sáme bokstáva

source: termwiki
smj: Giellagáldu moattegielak terma

source: west
smj: oarjje

source: {0}/{1} languages.
smj: {0}/{1} giela.

source: {0}/{1} sources.
smj: {0}/{1} gáldo

source: {stemsLength}/{totalCount} containing <0>{searchExpression}</0>
smj: {stemsLength}/{totalCount} majn sinna la <0>{searchExpression}</0>

source: {stemsLength}/{totalCount} ending in <0>{searchExpression}</0>
smj: {stemsLength}/{totalCount} majn låhpa l <0>{searchExpression}</0>

source: {stemsLength}/{totalCount} starting with <0>{searchExpression}</0>
smj: {stemsLength}/{totalCount} majn álggo l <0>{searchExpression}</0>

source: Álšateknihkka
smj: Energijjateknihkka

source: Ásttoáigi ja faláštallan
smj: Asstoájgge ja valástallam

source: Ávnnasindustriija
smj: Ábnasindustrijja
